In [1]:
import numpy as np
import pandas as pd

# Uvoz in priprava podatkov

## PRIMER 1

### 1. Read csv file into a pandas dataframe

In [3]:
# rešitev
dn = pd.read_csv('data/DATA_DN_property data.csv')

### 2. Take a look at the first 5 rows

In [27]:
# rešitev
dn.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0   104.0     PUTNAM            Y           3.0       1.0  1000.0
1  100002000.0   197.0  LEXINGTON            N           3.0       1.5     NaN
2  100003000.0     NaN  LEXINGTON            N           NaN       1.0   850.0
3  100004000.0   201.0   BERKELEY           12           1.0       NaN   700.0
4          NaN   203.0   BERKELEY            Y           3.0       2.0  1600.0

### 3. Select and print the ST_NUM column

In [6]:
# rešitev
dn_stnum = dn['ST_NUM']
print(dn_stnum)

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

### 4. Standard Missing Values: Check the misssing values in ST_NUM column with isnull() method

In [7]:
# rešitev
dn_stnum.isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

### 5. Non-Standard Missing Values: Pandas didn't recognized the "--" and "na" as a missing value. in the NUM_BEDROOMS column. Try to detect these various missing values with the na_values parameter when importing the data with read_csv.

In [12]:
#rešitev
dn = pd.read_csv('data/DATA_DN_property data.csv')
dn[dn['NUM_BEDROOMS']=='na']

           PID  ST_NUM  ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
8  100009000.0   215.0  TREMONT            Y           na       2.0  1800

In [13]:
dn = pd.read_csv('data/DATA_DN_property data.csv', na_values=['--', 'na'])

In [19]:
dn.head(10)

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1.0,850.0
3,100004000.0,201.0,BERKELEY,12,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,NaN,1.0,800.0
6,100007000.0,NaN,WASHINGTON,NaN,2.0,2.0,950.0
7,100008000.0,213.0,TREMONT,Y,NaN,1.0,NaN
8,100009000.0,215.0,TREMONT,Y,NaN,2.0,1800.0

### 6. Unexpected Missing Values

For example, if our feature is expected to be a string, but there’s a numeric type, then technically this is also a missing value.

#### Display the OWN_OCCUPIED column and it's missing values with isnull()

In [20]:
# rešitev
dn['OWN_OCCUPIED'][dn['OWN_OCCUPIED'].isnull()]

6    NaN
Name: OWN_OCCUPIED, dtype: object

In the fourth row, there’s the number 12. The response for Owner Occupied should clearly be a string (Y or N), so this numeric type should be a missing value.

#### Write a loop to detect int values in the OWN_OCCUPIED column and count them

In [34]:
# rešitev
dn['OWN_OCCUPIED'].str.isnumeric().sum()

1

### 7. Print the total number of missing values for each column.

In [36]:
# rešitev
dn.isnull().sum(axis=0)

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    1
NUM_BEDROOMS    4
NUM_BATH        1
SQ_FT           2
dtype: int64

### 8. Check to see if we have any missing values in the df at all in one line.

Hint: `.any()` method

In [41]:
#rešitev
dn.isnull().any().any()

True

### 9. Total count of missing values.

In [42]:
#rešitev
dn.isnull().sum(axis=0).sum()

11

### 10. Replace missing values with a number 125 in the ST_NUM column

In [44]:
# rešitev
dn['ST_NUM'].fillna(125, inplace=True)
dn

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,125.0,LEXINGTON,N,NaN,1.0,850.0
3,100004000.0,201.0,BERKELEY,12,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,NaN,1.0,800.0
6,100007000.0,125.0,WASHINGTON,NaN,2.0,2.0,950.0
7,100008000.0,213.0,TREMONT,Y,NaN,1.0,NaN
8,100009000.0,215.0,TREMONT,Y,NaN,2.0,1800.0

###  11. Replace missing values with a median value in the NUM_BEDROOMS column

In [47]:
# rešitev
dn['NUM_BEDROOMS'].fillna(dn['NUM_BEDROOMS'].mean(), inplace=True)
dn

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,125.0,LEXINGTON,N,2.4,1.0,850.0
3,100004000.0,201.0,BERKELEY,12,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,2.4,1.0,800.0
6,100007000.0,125.0,WASHINGTON,NaN,2.0,2.0,950.0
7,100008000.0,213.0,TREMONT,Y,2.4,1.0,NaN
8,100009000.0,215.0,TREMONT,Y,2.4,2.0,1800.0